00_simpleFoam/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

7
(
    freeSurface
    {
        type            patch;
        nFaces          2350;
        startFace       196096;
    }
    inletWater
    {
        type            patch;
        nFaces          230;
        startFace       198446;
    }
    outletWater
    {
        type            patch;
        nFaces          320;
        startFace       198676;
    }
    bedWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          2350;
        startFace       198996;
    }
    rightSide
    {
        type            wall;
        inGroups        1(wall);
        nFaces          6854;
        startFace       201346;
    }
    leftSide
    {
        type            wall;
        inGroups        1(wall);
        nFaces          6854;
        startFace       208200;
    }
    defaultFaces
    {
        type            empty;
        inGroups        1(empty);
        nFaces          0;
        startFace       215054;
    }
)

// ************************************************************************* //
